//1.Արտածել այն ամսաթիվը, որ կլինի ժամանակային հաշվարկի սկզբից 1 միլիարդ վայրկյան հետո:
//
// 2.Գրել ծրագիր, որը կհաշվի թե քանի վայրկյան է անցել տվյալ օրվա սկզբից մինչև ծրագիրը աշխատացնելը:
//
//
// 3. Ստեղծել օբեկտ : Պատահական գեներացնել օր ամիս տարի 1919 թվականից այս կողմ: Oբեկտի համար ստեղծել մեթոդ , որ կհաշվի տվյալ պատահական ամսաթվից քանի տարի է անցել մինչև այսօր, ընդ որում հաշվի պետք առնի ամբողջ տարիների քանակը:
//
//
// 4.while և for  ցիկլի միջոցով հաշվել 0  մինչև 10 միլիոն թվերի 1000 աստիճանը և  տեսնել , որ ցիկլն է ավելի արագ հաշվում: Արտածել երկուսի հաշվման ժամանակները:
//
//
// 5.Ստեղծել ֆունկցիա, որ մեկ վայրկյան պարբերությամբ կարտածի թվեր, այն տիրությում, որին ,
// որպես պարամետրեր տրված կլինի ֆունկցիայում:Օրինանակ printNumbers(5, 10) կարտածի 5,6, 7,8,9, 10 մեկ
// վարկյան պարբերությամբ:

function printNumbers(a, b) {
    for (let i = a; i < b; i++) {
        setTimeout(() => {
            console.log(i);
        }, 1000)
    }
}

printNumbers(5, 10)