//1. Գրել ծրագիր , որ կփոխի img1.jpg div-ի մեջ գտնվող p-երի  տեքստերը New text արտահայտությունով:
//
// 2.Ունենք 7 տողանոց և 7 սյունյականոց  աղյուսակ, որի բոլոր բջիջներում գրված է cell: Գրել կոդ , որը  անկյունագծի cell փոխարինի թվերով ինչպես img2-ում է:
//
// 3․Ունենք էջ , որում կա p  թեգեր: Ստանալ զանգված որում հավաքված կլինի p թեգերի պարունակությունները և արտածել այդ զանգվածը:
//
// 4․Ունենք վեբ էջ : Ստուգել արդյոք այդ body-ի մեջ գտնվող թեգերում  կա SUNNY SCHOOL բառը և արտածել այն թեգերի անուները որում այդ արտահայտությունը կա:
//
// 5.Ստեղծել ծրագիր որը կգտնի էջում գտնվող p թեգի  տեքստում քանի թիվ կա և արտածել այդ թվերի զանգվածը: