//1.Գրել ֆունկցիա, որը կհաշվի երկու թվերի տարբերության մոդուլը(միշտ տարբերությունը դրական թիվ լինի )
//
function home1(a, b) {
    return Math.abs(a - b)
}

// console.log(home1(2, 3));

// 2.Գրել ֆունկցիաներ, որոնցից առաջինը կստուգի արդյոք  մուտքագրված թիվը 25-65 հատվածում է թե ոչ,
// իսկ երկրորդը կստուգի թիվը պարզ է թե ոչ, պարզ են այն թվերը , որոնք իրենց կամ մեկի վրա են բաժանվում:
// Գրել կոդ որ կկանչի այս երկու ֆունկցիաներին մուտքագրված թվի համար, եթե երկու պայմաններին  էլ բավարարի թող արտածի <<ճիշտ է>> բառը,
// իսկ եթե գոնե մեկին չի բավարարում արտածի սխալ է բառը:
//
const num = prompt("Number")

function home2(n) {
    if (n >= 25 && n <= 65) {
        console.log("1. payman@ OK");
        for (let i = 2; i < n / 2; i++) {
            if (n % i === 0) return false
        }
        console.log("2. Prime e ճիշտ է");
    } else {
        console.log("սխալ է")
    }
}

home2(num)
//
// 3.Գրել ֆունկցիա , որը կստուգի արդյուք  օբյեկտը դատարակ է թե ոչ:
//
// 4.Կա օբեկտ  box անունով, որը ունի   հատկություններ big 250 արժեքով, middle 400 արժեքով  և small 350 աժեքով:
// Գրել ֆունկցիա որը կհաշվի այս հատկությունների աժեքների գումարը:
//
// 5.Ստեղծեք մարդ օբյեկտ: Այն պետք է ունենա անուն, ազգանուն, սեռ և տարիք հատկությունները:
// Ստեղծեք մեթոդ, որը կախված նրանից թե տվյալ մարդը ինչ սեռի ներկայացուցիչ է և որ տարիքային խմբին է
// պատկանում թող արտածի համապատասխան թեքստը:
//
//  ➢ Եթե նա կին է
//    o մեծ  63-ից, ապաարտածում է ՙՙնա տատիկ է՞՞:
//    o Եթե 17-63 տարեկան է, ապա արտածում է ՙՙնա աշխատող է՞՞:
//    o Եթե 0-17, ապա  արտածում է ՙՙնա փոքր աղջիկ է՞՞:
//  ➢ Եթե նա տղամարդ է
//    o մեծ 65-ից, ապա արտածում է  ՞՞նա պապիկ է՞՞:
//    o Եթե 17-65 տարեկան է, ապա արտածում է  ՞՞նա աշխատող է՞՞:
//    o Եթե 0-17, ապա  արտածում է ՞՞նա փոքր տղա է՞՞:
//
//  Մինչև այս մեթոդը կանչելը այցելուն կարող է prompt-ով փոխել  սեռը և տարիքը կամ թողնել նույնը, որից հետո կիմանա իր կարգավիճակը:
