// 1.Տրված  են իրարից տարբեր 𝑎,𝑏,𝑐 և 𝑑 թվերը: Կազմել ծրագիր, որը կարտածի տրված թվերից մեծագույնի արժեքը:
//
//     2.For ցիկլի  միջոցով արտածել 1-ից 100 հատվածի թվերը, բացառությամբ 8 և 9 վրա բաժանվողների: Թող ցիկլը ընդհատվի  երբ հանդիպի միաժամանակ և 6 և 7 վրա բաժանվող թվի:
//
//     3.Քանի որ JavaScript-ում շաբաթվա օրերը համարակալված են 0-6 թվերով,  switch միջոցով ստանալ ծրագիր, որ այդ միջակայքում մուտքագրված թվի համար կարտածի շաբաթվա տվյալ օրվա տառային տարբերակը:
//     Իսկ եթե թիվը այդ միջակայքից  դուրս է արտածի Error:
//
//     4.Գրել ծրագիր, որ թույլ կտա հաշվել այցելուի կողմից մուտքագրած
//     թիվը պարզ թիվ է թե ոչ: Պարզ են այն թվերը, որոնք բաժանվում են իրենց և 1-ի վրա:
//
//         5.Գրել կոդ, որ թույլ կտա ստանալ նկար 5-ի տեսքը: