//1.Ունենք զանգված կազմված բացասական, դրական թվերից և զրոյից:
// Գրել ծրագիր, որը կվերդասավորի մասիվը և կունենանք մեծից փոքր նվազող թվեր ունեցող  մասիվ:
//
arr=[-2,3,5,6,0,-4,-5]
console.log(arr.sort((a, b) => a - b));
// 2.Ունենք IT անունով "WEB","C++", "Python","C#","Java"; զանգված դարձնել  string  միավորված այս նշանով    ՞ <=> ՞:
// Տեսքը՝  <<WEB<=>C++<=>Python<=>C#<=>Java>>
//
//
// 3.Գրել ծրագիր ,որը պատահական թվով երկարություն ունեցող մասիվից կընտրի որևէ անդամ պատահական սկզբունքով:
//
// 4.Գրել ծրագիեր, որը թույլ կտա այցելուին մուտքագրել 7 տարբեր աժեքներ, այդ արժեքներից ստանալ երկու մասիվ, որոնցից առաջինում կլինեն
// այն արժեքներ, որն թվեր են միաժանակ զույգ և դրական՝, մյուս  կլինի մուտգարված արժեքներից նրանք, որոնք սկսում են մեծատառ կամ փոքրատառ
// ՞՞h՞՞ տառով:
//
//
// 5.Ստանալ 1-100 տիրույթում  պատահական 20 թվերից կազմված array : Բոլոր արժեքները հանել 1, հետո զտել բոլոր զույգ թվերը, այնուհետև
// ստուգել կա 0, 10, 20,30 կամ 40 արժեք ունեցող անդամ:Օգտագործել array-ի հետ կապված մեթեդները: